* NEXT No task
  :CLOCK:
  CLOCK: [2010-08-05 Thu 08:51]--[2010-08-05 Thu 09:50] =>  0:59
  CLOCK: [2010-08-04 Wed 22:41]--[2010-08-05 Thu 07:56] =>  9:15
  CLOCK: [2010-08-04 Wed 01:12]--[2010-08-04 Wed 01:38] =>  0:26
  CLOCK: [2010-08-03 Tue 23:12]--[2010-08-04 Wed 00:22] =>  1:10
  CLOCK: [2010-08-03 Tue 22:06]--[2010-08-03 Tue 22:33] =>  0:27
  CLOCK: [2010-08-03 Tue 20:52]--[2010-08-03 Tue 21:08] =>  0:16
  CLOCK: [2010-08-03 Tue 18:01]--[2010-08-03 Tue 20:23] =>  2:22
  CLOCK: [2010-08-03 Tue 17:22]--[2010-08-03 Tue 17:26] =>  0:04
  CLOCK: [2010-08-03 Tue 16:38]--[2010-08-03 Tue 16:55] =>  0:17
  CLOCK: [2010-08-03 Tue 14:20]--[2010-08-03 Tue 14:54] =>  0:34
  CLOCK: [2010-08-03 Tue 11:24]--[2010-08-03 Tue 11:25] =>  0:01
  CLOCK: [2010-08-03 Tue 11:08]--[2010-08-03 Tue 11:09] =>  0:01
  CLOCK: [2010-08-03 Tue 10:59]--[2010-08-03 Tue 11:04] =>  0:05
  CLOCK: [2010-08-03 Tue 09:07]--[2010-08-03 Tue 09:56] =>  0:49
  CLOCK: [2010-08-02 Mon 22:56]--[2010-08-03 Tue 08:51] =>  9:55
  CLOCK: [2010-08-02 Mon 22:39]--[2010-08-02 Mon 22:40] =>  0:01
  CLOCK: [2010-08-02 Mon 22:30]--[2010-08-02 Mon 22:34] =>  0:04
  CLOCK: [2010-08-02 Mon 22:18]--[2010-08-02 Mon 22:21] =>  0:03
  CLOCK: [2010-08-02 Mon 22:04]--[2010-08-02 Mon 22:12] =>  0:08
  CLOCK: [2010-08-01 Sun 08:54]--[2010-08-01 Sun 09:12] =>  0:18
  CLOCK: [2010-08-01 Sun 00:32]--[2010-08-01 Sun 01:24] =>  0:52
  CLOCK: [2010-07-31 Sat 23:50]--[2010-08-01 Sun 00:14] =>  0:24
  CLOCK: [2010-07-31 Sat 15:12]--[2010-07-31 Sat 23:09] =>  7:57
  CLOCK: [2010-07-31 Sat 13:44]--[2010-07-31 Sat 14:52] =>  1:08
  :END:
* Tasks
** NEXT Read sinatra code					       :RUBY:
   - State "NEXT"       from "TODO"       [2010-08-04 Wed 13:21]
   - State "TODO"       from "NEXT"       [2010-08-02 Mon 01:17]
   - State "NEXT"       from "TODO"       [2010-08-01 Sun 00:14]
   :CLOCK:
   CLOCK: [2010-08-04 Wed 13:56]--[2010-08-04 Wed 13:58] =>  0:02
   CLOCK: [2010-08-04 Wed 13:50]--[2010-08-04 Wed 13:56] =>  0:06
   CLOCK: [2010-08-04 Wed 13:47]--[2010-08-04 Wed 13:49] =>  0:02
   CLOCK: [2010-08-04 Wed 13:39]--[2010-08-04 Wed 13:47] =>  0:08
   CLOCK: [2010-08-04 Wed 13:26]--[2010-08-04 Wed 13:38] =>  0:12
   CLOCK: [2010-08-04 Wed 13:21]--[2010-08-04 Wed 13:26] =>  0:05
   CLOCK: [2010-08-01 Sun 00:14]--[2010-08-01 Sun 00:32] =>  0:18
   :END:
** TODO Read up on RSpec					       :RUBY:
   - State "TODO"       from "NEXT"       [2010-08-05 Thu 08:51]
   - State "NEXT"       from "TODO"       [2010-08-05 Thu 07:56]
   :CLOCK:
   CLOCK: [2010-08-05 Thu 08:19]--[2010-08-05 Thu 08:50] =>  0:31
   CLOCK: [2010-08-05 Thu 07:56]--[2010-08-05 Thu 08:18] =>  0:22
   :END:
** DONE Solve Ruby Quiz problem 1				       :RUBY:
   - State "DONE"       from "NEXT"       [2010-08-04 Wed 18:58]
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 12:54]
   - State "TODO"       from "NEXT"       [2010-08-02 Mon 01:17]
   - State "NEXT"       from "TODO"       [2010-08-01 Sun 18:05]
   - State "TODO"       from "NEXT"       [2010-07-31 Sat 23:49]
   :CLOCK:
   CLOCK: [2010-08-04 Wed 18:07]--[2010-08-04 Wed 18:57] =>  0:50
   CLOCK: [2010-08-04 Wed 17:56]--[2010-08-04 Wed 18:07] =>  0:11
   CLOCK: [2010-08-04 Wed 17:38]--[2010-08-04 Wed 17:56] =>  0:18
   CLOCK: [2010-08-04 Wed 17:21]--[2010-08-04 Wed 17:32] =>  0:11
   CLOCK: [2010-08-04 Wed 01:38]--[2010-08-04 Wed 02:18] =>  0:40
   CLOCK: [2010-08-04 Wed 00:22]--[2010-08-04 Wed 01:12] =>  0:50
   CLOCK: [2010-08-03 Tue 22:39]--[2010-08-03 Tue 23:12] =>  0:33
   CLOCK: [2010-08-03 Tue 22:33]--[2010-08-03 Tue 22:38] =>  0:05
   CLOCK: [2010-08-03 Tue 21:30]--[2010-08-03 Tue 22:06] =>  0:36
   CLOCK: [2010-08-03 Tue 21:08]--[2010-08-03 Tue 21:14] =>  0:06
   CLOCK: [2010-08-03 Tue 17:26]--[2010-08-03 Tue 18:01] =>  0:35
   CLOCK: [2010-08-03 Tue 14:15]--[2010-08-03 Tue 14:20] =>  0:05
   CLOCK: [2010-08-03 Tue 13:31]--[2010-08-03 Tue 13:50] =>  0:19
   CLOCK: [2010-08-03 Tue 12:54]--[2010-08-03 Tue 13:24] =>  0:30
   CLOCK: [2010-08-02 Mon 00:51]--[2010-08-02 Mon 01:03] =>  0:12
   CLOCK: [2010-08-01 Sun 18:05]--[2010-08-01 Sun 19:05] =>  1:00
   CLOCK: [2010-07-31 Sat 14:52]--[2010-07-31 Sat 15:12] =>  0:20
   :END:
   [2010-08-04 Wed 01:11] - move! function is not correct, shift is not implemented, logic error
** TODO Read Ruby I/O chapter 					       :RUBY:
** TODO Read up on org-mode						:ORG:
   :CLOCK:
   CLOCK: [2010-07-31 Sat 13:40]--[2010-07-31 Sat 14:44] =>  1:04
   :END:
*** DONE [[file:notes.org::*org%205%20minute%20tutorial][org 5 minute tutorial]]
    - State "DONE"       from "NEXT"       [2010-08-01 Sun 14:49]
    - State "NEXT"       from "TODO"       [2010-08-01 Sun 14:40]
    - State "NEXT"       from "TODO"       [2010-08-01 Sun 14:40]
    :CLOCK:
    CLOCK: [2010-08-01 Sun 14:40]--[2010-08-01 Sun 14:49] =>  0:09
    CLOCK: [2010-08-01 Sun 09:12]--[2010-08-01 Sun 09:14] =>  0:02
    :END:
    - State "TODO"       from ""           [2010-08-01 Sun 09:12]
*** NEXT [[file:notes.org::*compact%20org%20mode%20guide][compact org-mode guide]]
    - State "NEXT"       from "TODO"       [2010-08-04 Wed 12:40]
    - State "TODO"       from "NEXT"       [2010-08-03 Tue 10:59] \\
      read tags on org compact and sacha chua's article on org tags
    - State "NEXT"       from "TODO"       [2010-08-03 Tue 10:17]
    - State "TODO"       from "NEXT"       [2010-08-02 Mon 15:19] \\
      completed document structure
      started tables
    - State "NEXT"       from "TODO"       [2010-08-02 Mon 15:02]
    - State "TODO"       from "NEXT"       [2010-08-02 Mon 00:50] \\
      paused
    - State "NEXT"       from "TODO"       [2010-08-01 Sun 14:53]
    :CLOCK:
    CLOCK: [2010-08-05 Thu 10:11]--[2010-08-05 Thu 10:42] =>  0:31
    CLOCK: [2010-08-04 Wed 12:40]--[2010-08-04 Wed 13:06] =>  0:26
    CLOCK: [2010-08-03 Tue 10:17]--[2010-08-03 Tue 10:58] =>  0:41
    CLOCK: [2010-08-02 Mon 15:02]--[2010-08-02 Mon 15:20] =>  0:18
    CLOCK: [2010-08-01 Sun 14:55]--[2010-08-01 Sun 15:07] =>  0:12
    CLOCK: [2010-08-01 Sun 14:53]--[2010-08-01 Sun 14:55] =>  0:02
    :END:
** TODO add link shortcuts to org init				 :ACTION:ORG:
   :CLOCK:
   CLOCK: [2010-08-01 Sun 14:50]--[2010-08-01 Sun 14:51] =>  0:01
   :END:
   [2010-08-01 Sun 14:50]
   [[file:~/org/notes.org::*compact%20org%20mode%20guide][compact org-mode guide]]
** TODO [[file:notes.org::*magit][Read up on magit mode]]					  :GIT:EMACS:
** TODO Read up on rack						       :RUBY:
   - State "TODO"       from ""           [2010-08-01 Sun 00:21]
** DONE What is font lock in emacs				      :EMACS:
   - State "DONE"       from "NEXT"       [2010-08-02 Mon 15:30]
   - State "NEXT"       from "TODO"       [2010-08-02 Mon 15:26]
   :CLOCK:
   CLOCK: [2010-08-02 Mon 15:26]--[2010-08-02 Mon 15:30] =>  0:04
   :END:
   [2010-08-01 Sun 14:55]
   http://www.gnu.org/software/emacs/manual/html_node/emacs/Font-Lock.html
** DONE try out [[http://emacs-fu.blogspot.com/2010/06/console-apps-in-emacs-with-multi-term.html][multiterm]] for emacs			       :ACTION:EMACS:
   - State "DONE"       from "NEXT"       [2010-08-02 Mon 22:39]
   - State "NEXT"       from "TODO"       [2010-08-02 Mon 22:21]
   :CLOCK:
   CLOCK: [2010-08-02 Mon 22:34]--[2010-08-02 Mon 22:39] =>  0:05
   CLOCK: [2010-08-02 Mon 22:21]--[2010-08-02 Mon 22:30] =>  0:09
   :END:
   - State "TODO"       from ""           [2010-08-02 Mon 16:13]
     added multiterm and updated repo
** TODO check out [[http://emacs-fu.blogspot.com/2010/06/console-apps-in-emacs-with-multi-term.html][autopair]] emacs minor mode			      :EMACS:
   - State "TODO"       from ""           [2010-08-02 Mon 16:18]

** DONE evaluate [[http://stackoverflow.com/questions/9951/what-color-scheme-do-you-use-for-programming][color themes]] for emacs				      :EMACS:
   - State "DONE"       from "NEXT"       [2010-08-03 Tue 20:51]
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 20:43]
   - State "TODO"       from "NEXT"       [2010-08-03 Tue 09:07]
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 08:51]
   :CLOCK:
   CLOCK: [2010-08-03 Tue 20:43]--[2010-08-03 Tue 20:51] =>  0:08
   CLOCK: [2010-08-03 Tue 08:51]--[2010-08-03 Tue 09:07] =>  0:16
   :END:
   - State "TODO"       from ""           [2010-08-02 Mon 16:29]
     picked billw
** DONE evaluate [[http://stackoverflow.com/questions/555376/lgrep-and-rgrep-in-emacs][ack or grep]] for emacs				      :EMACS:
   - State "DONE"       from "NEXT"       [2010-08-03 Tue 11:43]
     added ack support to emacs
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 11:25]
   - State "TODO"       from "NEXT"       [2010-08-03 Tue 11:15] \\
     installed ack
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 11:09]
   :CLOCK:
   CLOCK: [2010-08-03 Tue 11:25]--[2010-08-03 Tue 11:43] =>  0:18
   CLOCK: [2010-08-03 Tue 11:11]--[2010-08-03 Tue 11:15] =>  0:04
   CLOCK: [2010-08-03 Tue 11:09]--[2010-08-03 Tue 11:11] =>  0:02
   :END:
  - State "TODO"       from ""           [2010-08-02 Mon 16:32]
    
** TODO use scheduling capabilities of org-mode			 :ORG:ACTION:
   - State "TODO"       from ""           [2010-08-02 Mon 16:33]

** TODO check out [[http://jugglingbits.wordpress.com/2010/05/16/announcing-delim-kill-el/][delimkill]] for emacs				      :EMACS:
   - State "TODO"       from ""           [2010-08-02 Mon 16
** DONE check out [[http://conkeror.org/][conkeror]], a keyboard oriented browser		     :ACTION:
   - State "DONE"       from "NEXT"       [2010-08-02 Mon 22:03]
   - State "NEXT"       from "TODO"       [2010-08-02 Mon 21:46]
   :CLOCK:
   CLOCK: [2010-08-02 Mon 21:46]--[2010-08-02 Mon 22:03] =>  0:17
   :END:
   - State "TODO"       from ""           [2010-08-02 Mon 16:53]
     installed conkeror and checked out its basic features, using it now as default browser

** DONE research music player alternatives for linux		     :LINUX::
   - State "DONE"       from "NEXT"       [2010-08-02 Mon 22:18]
   - State "NEXT"       from "TODO"       [2010-08-02 Mon 22:12]
   :CLOCK:
   CLOCK: [2010-08-02 Mon 22:12]--[2010-08-02 Mon 22:18] =>  0:06
   :END:
   - State "TODO"       from ""           [2010-08-02 Mon 22:12]

     picked rhythmbox
** DONE setup conkeror as default browser		      :ACTION:LINUX::
   - State "DONE"       from "NEXT"       [2010-08-02 Mon 22:56]
   - State "NEXT"       from "TODO"       [2010-08-02 Mon 22:40]
   :CLOCK:
   CLOCK: [2010-08-02 Mon 22:40]--[2010-08-02 Mon 22:56] =>  0:16
   :END:
   - State "TODO"       from ""           [2010-08-02 Mon 22:22]
** TODO research linux shells and pick one			     :LINUX::
   - State "TODO"       from ""           [2010-08-02 Mon 22:23]

** DONE fix incomplete initialization of emacs startup files   :EMACS:ACTION:
   - State "DONE"       from "TODO"       [2010-08-04 Wed 13:15]
   - State "TODO"       from ""           [2010-08-03 Tue 09:11]
** CANCELLED configure colors for tags in org mode		 :ACTION:ORG:
   - State "CANCELLED"  from "NEXT"       [2010-08-03 Tue 11:08] \\
     tags should be invisible until queries for
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 11:04]
   :CLOCK:
   CLOCK: [2010-08-03 Tue 11:04]--[2010-08-03 Tue 11:08] =>  0:04
   :END:
   - State "TODO"       from ""           [2010-08-03 Tue 10:46]
** TODO add sacha chua's org-calculate-tag-time to emacs init  :EMACS:ACTION:
   - State "TODO"       from ""           [2010-08-03 Tue 10:55]

** DONE learn ack						      :TOOLS:
   - State "DONE"       from "NEXT"       [2010-08-03 Tue 11:23]
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 11:16]
   :CLOCK:
   CLOCK: [2010-08-03 Tue 11:16]--[2010-08-03 Tue 11:23] =>  0:07
   :END:
   [2010-08-03 Tue 11:11]
   
   ack --type=ruby string_to_search

** DONE cleanup emacs library				       :EMACS:ACTION:
   - State "DONE"       from "NEXT"       [2010-08-03 Tue 12:00]
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 11:44]
   :CLOCK:
   CLOCK: [2010-08-03 Tue 11:44]--[2010-08-03 Tue 12:00] =>  0:16
   :END:
   - State "TODO"       from ""           [2010-08-03 Tue 11:44]
     merged emacs-linux to emacs24-linux
     deleted vendor/cedet
** TODO Implement rummy in Ruby					       :RUBY:
  :CLOCK:
  CLOCK: [2010-08-03 Tue 22:38]--[2010-08-03 Tue 22:39] =>  0:01
  :END:
  [2010-08-03 Tue 22:38]
** TODO read bastien guerry's column view intro				:ORG:
   - State "TODO"       from ""           [2010-08-04 Wed 12:52]

** NEXT Analyze ruby quiz solution and alternate solutions	       :RUBY:
   - State "NEXT"       from "TODO"       [2010-08-05 Thu 22:05]
   :CLOCK:
   CLOCK: [2010-08-05 Thu 22:05]--[2010-08-05 Thu 22:32] =>  0:27
   :END:
   - State "TODO"       from ""           [2010-08-04 Wed 18:58]
** TODO read up on exceptions in ruby				       :RUBY:
   :CLOCK:
   :END:
   [2010-08-04 Wed 13:26]
   [[file:~/ruby-projects/sinatra/lib/sinatra/base.rb::require%20thread][file:~/ruby-projects/sinatra/lib/sinatra/base.rb::require thread]]
** TODO what is the difference between passing zero and one arguments to inject :RUBY:
   :CLOCK:
   :END:
   [2010-08-04 Wed 13:47]
** TODO Read up on HTTP
   - State "NEXT"       from "TODO"       [2010-08-05 Thu 07:40]
   :CLOCK:
   CLOCK: [2010-08-04 Wed 13:49]--[2010-08-04 Wed 13:50] =>  0:01
   :END:
   [2010-08-04 Wed 13:49]
   [[file:~/ruby-projects/sinatra/lib/sinatra/base.rb::class%20Response%20Rack%20Response][file:~/ruby-projects/sinatra/lib/sinatra/base.rb::class Response Rack Response]]
** TODO Explain block.each					       :RUBY:
   :CLOCK:
   :END:
   [2010-08-04 Wed 13:56]
   [[file:~/ruby-projects/sinatra/lib/sinatra/base.rb::if%20block_given%20def%20block%20each%20yield%20call%20end%20What%20is%20this%20line%20EXPLAIN%20response%20body%20block%20else%20response%20body%20value%20end][file:~/ruby-projects/sinatra/lib/sinatra/base.rb::if block_given def block each yield call end What is this line EXPLAIN response body block else response body value end]]
** TODO investigate using global for spelunking ruby projects	       :RUBY:
   http://www.codespelunking.org/pages/cs_global.html
   :CLOCK:
   CLOCK: [2010-08-04 Wed 15:58]--[2010-08-04 Wed 15:59] =>  0:01
   :END:
   [2010-08-04 Wed 15:58]
** TODO add rdebug interface to emacs				      :EMACS:
   :CLOCK:
   :END:
   [2010-08-04 Wed 17:56]
   [[file:~/my-ruby/ruby-quiz/1/rubyquiz-1.rb::new_card_index%20current_card_index%20distance%20modulo%2054%201][file:~/my-ruby/ruby-quiz/1/rubyquiz-1.rb::new_card_index current_card_index distance modulo 54 1]]
** TODO find total time spend on a task in org mode			:ORG:
   :CLOCK:
   :END:
   [2010-08-04 Wed 18:07]

** TODO Evaluate and deploy best webserver for rails		      :RAILS:
   - State "TODO"       from ""           [2010-08-06 Fri 00:12]
** TODO Learn linux system administration			      :LINUX:
   - State "TODO"       from ""           [2010-08-06 Fri 10:43]

** NEXT Configure [[file:notes.org::*fluxbox][fluxbox]]					      :LINUX:
   - State "NEXT"       from "TODO"       [2010-08-16 Mon 19:51]
   :CLOCK:
   CLOCK: [2010-08-16 Mon 19:51]--[2010-08-16 Mon 20:19] =>  0:28
   :END:
   - State "TODO"       from ""           [2010-08-16 Mon 19:50]
